<script setup>
import { useMobileStore } from "~/stores/MobileMenu.js";
const store = useMobileStore();
import { useAccountStore } from "~/stores/accountStore";
const {isMobile} = storeToRefs(useAccountStore());
watch(isMobile, (newVal, oldVal) => {
  
  if(newVal) {
    window.scrollTo(0, 0)
    document.body.style.overflow = 'hidden';
    return;
  }
  document.body.style.overflow = 'auto';
})
const props = defineProps({
  index: {
    type: Number,
    required: true,
  },
});

onMounted(() => {
  console.log(window.screen.width)
  if(window.screen.width < 822) {
    document.body.style.overflow = 'hidden';
  }
})

onBeforeUnmount(() => {
  document.body.style.overflow = 'auto';
})
const public_offer = [
  {
    title: "Пользовательское соглашение",
    content:
      "Это соглашение регулирует отношения между Лицензиаром и Пользователем при использовании функционала Сервиса. Соглашение является договором присоединения. Внимательно прочитайте текст соглашения. Если вы не согласны с условиями, ТОО MONEYDEAL рекомендует отказаться от использования сервиса.",
  },

  {
    title: "Термины",
    list: [
      {
        title:
          "1.1. Лицензиар – Партнерство ТОО MONEYDEAL, БИН: 221140056789, которому принадлежат исключительные права на Сервис и которое предоставляет Пользователю право на использование функционала Сервиса на основании простой (неисключительной) лицензии.",
      },
      {
        title:
          "1.2. Пользователь – дееспособное физическое лицо, присоединившееся к условиям Соглашения и использующее функционал Сервиса.",
      },
      {
        title:
          "1.3. Сервис – совокупность информации, текстов, графических элементов, дизайна, программного обеспечения, баз данных и иных результатов интеллектуальной деятельности, доступных по адресу в интернете.",
      },
      {
        title:
          "1.4. Личный кабинет – функционал Сервиса, доступный Пользователю после регистрации, с возможностью доступа к платному функционалу после оплаты.",
      },
      {
        title:
          "1.5. Кредитор – лицо, указанное в Приложении №1 к Соглашению, с которым Лицензиар заключил договор и которое вправе направлять уведомления и предложения Пользователю о заключении Договора займа.",
      },
      {
        title:
          "1.5.1. Партнер – лицо, указанное в Приложении №1 к Соглашению, с которым Лицензиар заключил договор и которое вправе направлять уведомления и предложения Пользователю.",
      },
      {
        title:
          "1.6. Кредитный рейтинг – оценка кредитоспособности Пользователя, осуществляемая функционалом Сервиса на основе предоставленной информации.",
      },
      {
        title:
          "1.7. Договор о предоставлении микрокредита – договор, заключаемый между Пользователем и Кредитором о предоставлении денег на условиях платности, срочности и возвратности.",
      },
      {
        title:
          "1.8. Термины, не определенные в Соглашении, толкуются в соответствии с действующим законодательством Республики Казахстан.",
      },
    ],
  },

  {
    title: "Предмет соглашения",
    list: [
      {
        title:
          "2.1. Лицензиар предоставляет Пользователю право на использование функционала Сервиса, а при оплате лицензионного вознаграждения – на использование платного функционала Сервиса.",
      },
      {
        title:
          "2.2. Права использования функционала Сервиса предоставляются Пользователю с сохранением за Лицензиаром права выдачи лицензий другим лицам.",
      },
      {
        title: "2.3. Разрешенные способы использования Сервиса",
        sublist: [
          {
            content:
              "2.3.1. Доступ к информации, размещенной в Сервисе. Часть информации может быть доступна только после получения доступа к Личному кабинету и платному функционалу.",
          },
          {
            content:
              "2.3.2. Предоставление Пользователем полных и достоверных сведений о себе.",
          },
          {
            content: "2.3.3. Прохождение регистрации и авторизации в Сервисе.",
          },
          {
            content: "2.3.4. Взаимодействие с Лицензиаром.",
          },
          {
            content:
              "2.3.5. Передача информации Лицензиару через формы в Сервисе.",
          },
          {
            content: "2.3.6. Доступ к платному функционалу Сервиса.",
          },
          {
            content:
              "2.3.7. Использование иного функционала Сервиса в соответствии с его назначением.",
          },
        ],
      },
      {
        title:
          "2.4. Никакие иные права на Сервис, кроме указанных в пункте 2.3, Пользователю не предоставляются.",
      },
      {
        title:
          "2.5. Пользователь не вправе предпринимать действия, включая изменение кода, модификацию, декомпиляцию и использование методов социальной инженерии для получения доступа к личным данным других Пользователей.",
      },
      {
        title:
          "2.6. Срок использования функционала Сервиса: до прекращения Соглашения или исключительных прав на Сервис. Для платного функционала срок составляет 5 дней с момента оплаты.",
      },
      {
        title:
          "2.7. Срок использования платного функционала: в течение 5 дней с даты оплаты лицензионного вознаграждения.",
      },
      {
        title: "2.8. Территория использования Сервиса – Республика Казахстан.",
      },
      {
        title:
          "2.9. Условия Соглашения распространяются на обновления и новые версии Сервиса.",
      },
      {
        title:
          "2.10. Ни одно положение Соглашения не может толковаться как передача исключительных прав или лицензии на весь Сервис или его части.",
      },
      {
        title:
          "2.11. Информация в Сервисе является результатом интеллектуальной деятельности Лицензиара. Все права на такую информацию принадлежат Лицензиару до тех пор, пока не установлено иное.",
      },
    ],
  },

  {
    title: "Условия оплаты",
    list: [
      {
        title:
          "3.1. Плата за использование Сервиса составляет 3999 тенге. Эта сумма списывается за 5 дней использования с момента оформления заявки. Если подписка не отменена, плата будет списываться автоматически.",
      },
      {
        title:
          "3.2. Если услуга больше не актуальна (вы получили микрокредит или не нуждаетесь в нем), вы можете самостоятельно отписаться от услуги в любой момент. Подписка отменяется через соответствующую функцию.",
      },
      {
        title:
          "3.3. Сайт использует куки для предоставления сервиса. Условия хранения куки можно настроить в браузере. Для удаления персональных данных отправьте письмо на адрес experts@moneydeal.pro с просьбой удалить данные. Письмо должно содержать фразу: “Прошу удалить мои персональные данные”. Данное действие необратимо.",
      },
    ],
  },

  {
    title: "Функционал Сервиса",
    list: [
      {
        title: "4.1. Функционал Сервиса предназначен для:",
        sublist: [
          {
            content: "4.1.1. регистрации, авторизации Пользователя в Сервисе;",
          },
          {
            content:
              "4.1.2. сбора информации о Пользователе, получение информации от третьих лиц, в информационных системах и базах данных, которые принадлежат третьим лицам;",
          },
          {
            content: "4.1.3. оценки информации, представленной Пользователем;",
          },
          {
            content:
              "4.1.4. направления информации о Пользователе Кредиторам по результатам оценки;",
          },
          {
            content:
              "4.1.5. передачи информации Пользователю о Кредиторах, которые приняли предварительное решение о заключении с Пользователем Договора займа;",
          },
          {
            content:
              "4.1.6. направления Пользователю информации об акциях, предложениях, услугах Лицензиара, Кредиторов по каналам электросвязи;",
          },
          {
            content:
              "4.1.7. предоставление Пользователю информации, полученной о нем от третьих лиц, в информационных системах и базах данных, которые принадлежат третьим лицам;",
          },
          {
            content:
              "4.1.8. предоставление Пользователю информации, размещенной Лицензиаром в Сервисе.",
          },
        ],
      },
      {
        title:
          "4.2. В рамках исполнения п. 4.1.2 и 4.1.7 Пользовательского соглашения, Пользователь выражает согласие на передачу персональных данных “ТОО “Первое кредитное бюро“” и соглашается на получение персонального кредитного рейтинга, сформированного “ТОО “Первое кредитное бюро“”, с использованием Сервиса.",
      },
      {
        title:
          "4.3. Пользователь не вправе использовать Сервис способами, не предусмотренными Пользовательским соглашением.",
      },
      {
        title:
          "4.4. Лицензиар предоставляет доступ к функционалу Сервиса безвозмездно, за исключением доступа к платному функционалу Сервиса. Услуга считается оказанной в момент получения доступа к Сервису. К платному функционалу Сервиса относятся следующие разделы Личного кабинета:",
        list: [
          {
            title:
              "4.4.1. Предоставление и обновление информации в разделах Личного кабинета:",
            sublist: [
              {
                content:
                  "4.4.1.1. Кредитный рейтинг. В данном разделе Личного кабинета отражается информация о Кредитном рейтинге, который был присвоен Пользователю. Кредитный рейтинг присваивается Пользователю после регистрации в Сервисе на основании информации, которую Пользователь представил, и алгоритмов, заложенных в функционал Сервиса. Кредитный рейтинг предназначен для информирования Пользователя и не является обязательным для Кредитора;",
              },
              {
                content:
                  "4.4.1.2. Задолженность. В данном разделе Личного кабинета отражается информация по исполнительным производствам, по которым Пользователь выступает (или был) должником. Информация, указанная в п. 4.2 Пользовательского соглашению, предоставляется и обновляется в день оплаты лицензионного вознаграждения.",
              },
            ],
          },
          {
            content:
              "4.4.2. Доступ к информации, которая размещена в разделах Личного кабинета, доступ к которым Лицензиар предоставляет Пользователю после оплаты лицензионного вознаграждения. Доступ к информации, указанной в п. 4.2 Пользовательского соглашения, предоставляется на срок, указанный в п. 2.7. Пользовательского соглашения.",
          },
        ],
      },
      {
        title:
          "4.5. После регистрации в Сервисе информация о Пользователе в автоматическом режиме направляется Кредиторам, требованиям которых соответствует Пользователь, для принятия предварительного решения о заключении Договора о предоставлении микрокредита, а также направляется Партнерам, которые, в свою очередь, передают информацию Кредиторам.",
      },
      {
        title:
          "4.6. После направления информации о Пользователе Кредиторам, высвечивается статус: «В обработке».",
      },
      {
        title:
          "4.7. Если информация о Пользователе дошла кредитору, отображается статус «Отправленные».",
      },
      {
        title:
          "4.8. Если информация о Пользователе не дошла кредитору, отображается статус «Ошибка». В таком случае следует проверить указанную в Личном кабинете информацию и инициировать ее повторную отправку.",
      },
      {
        title:
          "4.9. Пользователь может выбрать любого Кредитора, который указан в Личном кабинете и который принял положительное предварительное решение о заключении Договора о предоставлении микрокредита, и перейти на сайт Кредитора для заключения Договора о предоставлении микрокредита. Договор о предоставлении микрокредита заключается в соответствии с локальными актами Кредитора.",
      },
      {
        title:
          "4.10. Пользователь не вправе требовать от Кредитора заключения с ним Договора о предоставлении микрокредита. Кредитор может отказать Пользователю в заключении Договора о предоставлении микрокредита.",
      },
      {
        title:
          "4.11. Лицензиар, Партнеры и Кредиторы при использовании функционала Сервиса направляют на электронную почту, на номер мобильного телефона Пользователя информационные и рекламные материалы, в которых может содержаться реклама товара, услуг Лицензиара, Кредиторов. Пользователь вправе отказаться от получения информационных и рекламных материалов, путем нажатия на гиперссылку, которая содержится в электронном письме, рядом с текстом «Чтобы отписаться от этой рассылки, перейдите по ссылке» и подтверждения волеизъявления посредством нажатия кнопки «Выполнить», или, направив обращение Лицензиару об отказе в получении рекламы, посредством заполнения формы в Сервисе.",
      },
      {
        title:
          "4.12. Стороны не составляют акт о передаче логина и пароля, номера заявки доступа к функционалу Личного кабинета.",
      },
      {
        title:
          "4.13. Пользователь не составляет и не обязан предоставлять Лицензиару отчет об использовании Сервиса.",
      },
    ],
  },

  {
    title: "Регистрация и авторизация Пользователя в Сервисе",
    list: [
      {
        title:
          "5.1. При регистрации в Сервисе Пользователь через форму, размещенную в Сервисе, передает Лицензиару следующую информацию о себе:",
        sublist: [
          {
            content: "Фамилию, имя, отчество (при наличии);",
          },
          {
            content: "Дату рождения;",
          },
          {
            content: "Адрес электронной почты;",
          },
          {
            content: "Номер телефона;",
          },
          {
            content: "ИИН",
          },
        ],
      },
      {
        title:
          "5.2. При регистрации в Сервисе Пользователь также передает Лицензиару данные о размере и сроке запрашиваемого микрокредита.",
      },
      {
        title:
          "5.3. Пользователь гарантирует, что при регистрации предоставляет полную и достоверную информацию о себе. Лицензиар имеет право проверить достоверность предоставленных данных через открытые источники, включая государственные информационные системы.",
      },
      {
        title:
          "5.4. Пользователь присоединяется к условиям Пользовательского соглашения путем выполнения действий, указанных в пунктах 5.1 и 5.2 Пользовательского соглашения.",
      },
      {
        title:
          "5.5. Регистрация Пользователя считается завершенной с момента выполнения действий, указанных в пунктах 5.1 и 5.2, и нажатия кнопки «Продолжить» в Сервисе.",
      },
      {
        title:
          "5.6. Пользователь несет все риски, связанные с предоставлением недостоверной информации о себе и о размере запрашиваемого микрокредита.",
      },
      {
        title:
          "5.7. Присоединяясь к условиям Пользовательского соглашения, Пользователь:",
        sublist: [
          {
            content:
              "подтверждает, что обладает необходимой правоспособностью и дееспособностью для исполнения условий Пользовательского соглашения и несет ответственность за нарушение Пользовательского соглашения, в том числе за действия, связанные с использованием Сервиса;",
          },
          {
            content:
              "при регистрации указал полную и достоверную информацию о себе;",
          },
          {
            content:
              "признает, что ознакомлен с условиями Пользовательского соглашения и Политикой обработки персональных данных;",
          },
          {
            content:
              "признает и подтверждает, что все положения Пользовательского соглашения и Политики обработки персональных данных ему понятны и не требуют дополнительного разъяснения;",
          },
          {
            content:
              "выражает полное согласие с условиями Пользовательского соглашения, Политикой обработки персональных данных, а также соглашается на получение рекламной и информационной рассылки.",
          },
        ],
      },
      {
        title:
          "5.8. Для проверки достоверности данных о банковском счете, указанных Пользователем при регистрации, Лицензиар вправе списать с банковского счета Пользователя до 100 (сто) казахских тенге, после чего возвращает списанную сумму на тот же счет. Если предоставлены недостоверные сведения о банковском счете или недостаточно средств для проверки, Лицензиар предоставляет Пользователю доступ к функционалу Сервиса, за исключением платного функционала.",
      },
      {
        title:
          "5.9. Пользователь может указать или изменить сведения о банковском счете для оплаты лицензионного вознаграждения после получения доступа к функционалу Сервиса в Личном кабинете.",
      },
      {
        title:
          "5.10. После регистрации Лицензиар направляет на адрес электронной почты Пользователя логин и пароль для последующей авторизации в Личном кабинете.",
      },
      {
        title:
          "5.11. Для использования Личного кабинета Пользователь должен авторизоваться в Сервисе, используя логин и пароль или номер телефона, указанный при регистрации, и пароль.",
      },
      {
        title:
          "5.12. Пользователь имеет право изменить пароль для авторизации в Сервисе через функционал Сервиса.",
      },
      {
        title:
          "5.13. Пользователь может восстановить доступ к Личному кабинету через адрес электронной почты, указанный при регистрации.",
      },
    ],
  },

  {
    title: "Лицензионное вознаграждение",
    list: [
      {
        title:
          "6.1. Лицензиар предоставляет Пользователю право использовать функционал Сервиса бесплатно, за исключением платного функционала Сервиса.",
      },
      {
        title:
          "6.2. Оплата лицензионного вознаграждения осуществляется по полной предоплате. Оплата за услуги Сервиса составляет 3999 тенге.",
      },
      {
        title:
          "6.3. Лицензионное вознаграждение и срок платного использования Сервиса доводятся до сведения Пользователя перед оплатой. Размер лицензионного вознаграждения может быть изменен Лицензиаром. Изменения вступают в силу с начала следующего платного периода.",
      },
      {
        title:
          "6.4. Сумма лицензионного вознаграждения автоматически списывается с банковского счета Пользователя при наличии достаточных средств. Списание лицензионного вознаграждения происходит периодически после проверки данных о банковском счете и до получения отказа от платного функционала. Лицензиар вправе совершать дополнительные попытки списания, если сумма не была зачислена.",
      },
      {
        title:
          "6.5. Пользователь может отказаться от доступа к платному функционалу, заполнив форму в Сервисе. Если отказ не подан, сумма лицензионного вознаграждения будет автоматически списываться с банковского счета.",
      },
      {
        title:
          "6.6. Если отказ от платного функционала направлен до окончания срока предоставления доступа, лицензионное вознаграждение и пропорциональная часть не подлежат возврату.",
      },
      {
        title:
          "6.7. Чек об оплате лицензионного вознаграждения направляется Пользователю на указанный при регистрации адрес электронной почты.",
      },
      {
        title:
          "6.8. Правила возврата и отмены лицензионного вознаграждения размещены в Сервисе.",
      },
    ],
  },

  {
    title: "Права и обязанности Лицензиара",
    list: [
      {
        title:
          "7.1. Лицензиар вправе размещать в Сервисе рекламные блоки, баннеры и объявления в любых областях Сервиса без дополнительного согласия Пользователя.",
      },
      {
        title:
          "7.2. Лицензиар вправе заблокировать доступ к функционалу Сервиса при наличии обоснованных претензий от третьих лиц, выявлении противоправной деятельности или нарушении условий Пользовательского соглашения.",
      },
      {
        title:
          "7.3. Лицензиар вправе ограничить часть функционала Сервиса для проведения профилактических и технических работ на сервере.",
      },
      {
        title:
          "7.4. Лицензиар обеспечивает круглосуточный доступ к функционалу Сервиса, за исключением периодов профилактических и технических работ.",
      },
      {
        title:
          "7.5. Лицензиар вправе приостанавливать работу Сервиса и ограничивать доступ для проведения профилактических и технических работ. Работы проводятся по возможности в ночное время или выходные дни, согласно часовому поясу Лицензиара.",
      },
      {
        title:
          "7.6. Лицензиар вправе вносить изменения в функционал Сервиса и выпускать обновленные версии.",
      },
    ],
  },
  {
    title: "Права и обязанности Пользователя",
    list: [
      {
        title:
          "8.1. Пользователь вправе в Личном кабинете изменять информацию, которую он указал при регистрации.",
      },
      {
        title:
          "8.2. Пользователь наделяет Лицензиара полномочиями на направление информации о нем Кредиторам или Партнерам для рассмотрения возможности заключения Договора займа.",
      },
      {
        title:
          "8.3. Пользователь обязуется предотвращать несанкционированный доступ к логину и паролю, а также незамедлительно уведомлять Лицензиара о случаях нарушения безопасности.",
      },
    ],
  },

  {
    title: "Ответственность",
    list: [
      {
        content:
          "9.1. Лицензиар предоставляет Сервис Пользователю «как есть» (as is) в соответствии с общепринятым в международной практике принципом. Лицензиар не несет ответственности за проблемы, возникающие в процессе использования, обновления, поддержки и эксплуатации Сервиса (в т. ч. проблемы совместимости с другими программными продуктами (пакетами, драйверами и др.), несоответствия результатов использования Сервиса ожиданиям Пользователя, ошибок в расчетах и т.п.). Пользователь несет полную ответственность за любые негативные последствия, возникшие из-за несовместимости или конфликтов Сервиса с другими программными продуктами, установленными на его устройстве.",
      },
      {
        title:
          "9.2. Пользователь обязан возместить Лицензиару все убытки, вызванные нарушением Пользователем условий Пользовательского соглашения.",
      },
      {
        title:
          "9.3. Лицензиар не несет ответственности перед Пользователем в следующих случаях:",
        sublist: [
          {
            content:
              "При возникновении убытков у Пользователя из-за неисполнения обязанностей, предусмотренных п. 10.10 Пользовательского соглашения.",
          },
          {
            content: "За принятие решения о заключении Договора займа.",
          },
          {
            content:
              "За достоверность информации, предоставляемой Пользователю Кредиторами и Партнерами.",
          },
          {
            content:
              "За содержание электронных писем, направленных Пользователю с информацией о Кредиторах и Партнерах.",
          },
          {
            content:
              "За результаты посещения Пользователем сторонних ресурсов, ссылки на которые могут быть размещены в Сервисе.",
          },
          {
            content:
              "За обстоятельства, находящиеся вне контроля Лицензиара, включая действия и бездействие Пользователя, а также противоправные действия третьих лиц.",
          },
          {
            content:
              "За отсутствие или невозможность установления Интернет-соединения между сервером Пользователя и сервером, где расположен Сервис.",
          },
          {
            content:
              "При проведении государственных или муниципальных органов, а также иных организаций оперативно-розыскных мероприятий.",
          },
          {
            content:
              "При установлении государственного регулирования (или регулирования иными организациями) хозяйственной деятельности в сети Интернет, или введении ограничений, затрудняющих или делающих невозможным исполнение Пользовательского соглашения.",
          },
          {
            content:
              "За нарушение Пользователем условий Пользовательского соглашения.",
          },
          {
            content:
              "За временное отсутствие доступа к функционалу Сервиса или Личному кабинету в связи с проведением профилактических работ и связанными с этим убытками Пользователя.",
          },
        ],
      },
      {
        title:
          "9.4. Пользователь несет полную ответственность за все действия, совершаемые через его Личный кабинет.",
      },
      {
        title:
          "9.5. Доступ к функционалу Сервиса может быть ограничен, если Пользователь использует его в информационных системах, работающих в опасных условиях или обслуживающих системы жизнеобеспечения, в которых сбой может представлять угрозу жизни людей или привести к значительным убыткам. Также сервис может работать некорректно при блокировке всех файлов cookie или использовании сети TOR.",
      },
      {
        title:
          "9.6. Лицензиар не несет ответственности перед третьими лицами за действия Пользователя с использованием Сервиса, а также за невыполнение Пользователем обязательств перед третьими лицами.",
      },
      {
        title:
          "9.7. Стороны не несут ответственности за частичное или полное неисполнение обязательств по соглашению, если это вызвано обстоятельствами непреодолимой силы, возникшими после заключения соглашения, такими как стихийные бедствия, войны, террористические акты или изменения законодательства, препятствующие исполнению обязательств. Сторона, попавшая под действие таких обстоятельств, обязана уведомить другую сторону в течение 10 дней.",
      },
      {
        title:
          "9.8. Пользователь несет ответственность за сохранность своих данных для входа в Личный кабинет и возможные убытки, вызванные их несанкционированным использованием.",
      },
      {
        title:
          "9.9. В случае предоставления Пользователем неверного адреса электронной почты, ответственность за невозможность получения чеков об оплате возлагается на него.",
      },
    ],
  },

  {
    title: "Урегулирование споров",
    list: [
      {
        title:
          "10.1. В случае возникновения спора между Пользователем и Лицензиаром, стороны обязуются направить претензию другой стороне. Ответ на претензию должен быть предоставлен в течение 20 рабочих дней с момента её получения.",
      },
      {
        title:
          "10.2. Если спор не может быть урегулирован претензионным порядком, он подлежит передаче на рассмотрение суда в соответствии с законодательством Республики Казахстан.",
      },
    ],
  },

  {
    title: "Заключительные положения",
    list: [
      {
        title:
          "11.1. Условия Пользовательского соглашения распространяются на всех Пользователей.",
      },
      {
        title:
          "11.2. Соглашение не требует двусторонней подписи и действительно в электронной форме.",
      },
      {
        title: "11.3. Соглашение не является публичной офертой Лицензиара.",
      },
      {
        title:
          "11.4. Лицензиар не предоставляет потребительские займы и не является стороной, поручителем или выгодоприобретателем по Договору займа. Кредитор и Пользователь не вправе предъявлять требования к Лицензиару по этому договору.",
      },
      {
        title:
          "11.5. Соглашение становится обязательным для Пользователя с момента его принятия и действует бессрочно.",
      },
      {
        title:
          "11.6. Уступка прав и обязанностей по договору без согласия Лицензиара не допускается.",
      },
      {
        title: "11.7. Основания прекращения соглашения:",
        sublist: [
          {
            content:
              "Лицензиар вправе отказаться от исполнения соглашения в случае нарушения Пользователем его условий.",
          },
          {
            content:
              "Пользователь вправе отказаться от использования платного функционала Сервиса, подав соответствующий запрос через форму обращения на сайте.",
          },
        ],
      },

      {
        title:
          "11.8. Лицензиар вправе в одностороннем порядке вносить изменения в условия соглашения без согласования с Пользователем.",
      },
      {
        title:
          "11.9. Принятие изменений Пользовательского соглашения осуществляется путём авторизации на Сервисе. Пользователь обязан отслеживать изменения каждый раз при авторизации.",
      },
      {
        title:
          "11.10. Если Пользователь не согласен с изменениями, он обязан прекратить использование Сервиса. Продолжение использования считается согласием с новыми условиями.",
      },
      {
        title:
          "11.11. Актуальная версия соглашения доступна на сайте https://moneydeal.kz/documents/public-offer/",
      },
    ],
  },

  {
    title: "Оплата услуг сервиса",
    list: [
      {
        title:
          "12.1. Оплата за использование платного функционала сервиса составляет 3999 тенге. Пользователь обязан своевременно вносить оплату для продолжения использования сервиса.",
      },
      {
        title:
          "12.2. Пользователь несет ответственность за корректность предоставляемых данных для оплаты. В случае ошибки или невозможности оплаты, доступ к функционалу может быть ограничен.",
      },
    ],
  },
  {
    title: "Кредиторы",
    list: [
      {
        title:
          "ТОО «Aiken Tech»: БИН: 221140044240; Адрес: 050059, Казахстан, г. Алматы, пр. Аль-Фараби, 19 н.п. 3В.",
      },
      {
        title:
          "ТОО «ЧЕСТНОЕ СЛОВО КАЗАХСТАН»: БИН 151240001473; Адрес: 050059, Казахстан, г. Алматы, пр. Аль-Фараби, д. 19, офис А29.",
      },
      {
        title:
          "ТОО «Онлайн Финанс»: БИН 131040003706; Адрес: Казахстан, г. Алматы, Алмалинский район, Улица Курмангалиева, 14, почтовый индекс 050010.",
      },
      {
        title:
          "ТОО «Займер»: БИН 150640017779; Адрес: 050061, Республика Казахстан, г. Алматы, пр. Райымбека 208А, офис 222.",
      },
      {
        title:
          "ТОО МФО «Kredit Seven Kazakhstan (Кредит Севен Казахстан)»: БИН 141040021499; Адрес: Алматы, Алмалинский район, пр. Жибек жолы, д. 135, оф. 1082.",
      },
      {
        title:
          "ТОО Микрофинансовая организация «TodayFinance Kazakhstan»: БИН 210840019151; Адрес: Казахстан, город Алматы, улица Макатаева, дом 127, почтовый индекс 050000.",
      },
      {
        title:
          "ТОО Микрофинансовая организация «CreditBar (КредитБар)»: БИН 2209400113234; Адрес: Республика Казахстан, г. Астана, район «Есиль», улица Дінмұхамед Қонаев, здание № 12/1, Встроенное помещение 27.",
      },
      {
        title:
          "ТОО МФО «ONE CREDIT»: БИН 220940025716; Адрес: Республика Казахстан, г. Алматы, Алмалинский район, ул. Богенбай батыра, д. 142, каб. 502, почтовый индекс 050000.",
      },
      {
        title:
          "ТОО МФО «AUTO SIYLIQ FINANCE»: БИН 220240035629050016; Адрес: Республика Казахстан, г. Алматы, Алмалинский район, Проспект Сейфуллина, дом №404/67, н.п. 3, каб. 301.",
      },
      {
        title:
          "ТОО Микрофинансовая организация «ЮНИКРЕДО»: БИН: 191140009869; Адрес: 050010, РК, г. Алматы, ул. Жандосова, д. 2, офис 218.",
      },
      {
        title:
          "ТОО «МФО «СиСиЛоун.кз»: БИН: 151040016751; Адрес: Республика Казахстан, г. Алматы, Алмалинский район, 050012 ул. Муратбаева, 180 офис 405.",
      },
      {
        title:
          "ТОО Микрофинансовая организация «Quick Money»: БИН 161040009235; Адрес: 041609, Алматинская область, Талгарский район, с.о. Бесагашский, с. Бесагаш, ул. Казыбек би, дом 25.",
      },
      {
        title:
          "ТОО МФО «Деньги говорят»: БИН 190540004760; Адрес: Республика Казахстан, 050023 г. Алматы, Бостандыкский р-н, микрорайон Нур Алатау, Е. Рахмадиев, 25А.",
      },
      {
        title:
          "ТОО Микрофинансовая организация «Lending and Finance technologies»: БИН 150840012933; Адрес: 150000, Республика Казахстан, Северо-Казахстанская область, г. Петропавловск, ул. Нурсултан Назарбаев, д. 134.",
      },
      {
        title:
          "ТОО «МФО Смартолёт Финанс»: БИН: 220440002322; Адрес: г. Алматы, Медеуский район, пр. Достык 210.",
      },
      {
        title:
          "ТОО МФО «PROcredit»: БИН/ИИН 220940037204; Адрес: Республика Казахстан, город Алматы Медеуский район, улица Фонвизина, дом № 10.",
      },
    ],
  },

  {
    title: "Партнеры",
    list: [
      {
        title:
          "ТОО «Финансовый Консультант»: БИН 220740019000; Адрес: Республика Казахстан, г. Астана, проспект Кабанбай Батыр, дом 6/6, кв 44, 010000.",
      },
      {
        title:
          "ТОО «GranIT co»: БИН 221140025204; Адрес: Казахстан, город Алматы, Медеуский район, улица Чаплина, дом 71/66, почтовый индекс 050000.",
      },
      {
        title:
          "ТОО «Лемонза»: БИН: 220440016678; Адрес: Казахстан, город Нур-Султан, район Сарыарка, улица Бейбітшілік, здание 14.",
      },
    ],
  },
];
let pricing_offer = [
  {
    title: "Пользовательское соглашение",
    content:
      "Данный документ устанавливает отношения между Лицензиаром и Пользователем при использовании функциональных возможностей Сервиса. Соглашение выступает договором присоединения. Внимательно ознакомьтесь с текстом документа. Если вы не согласны с его условиями, TOO MONEYDEAL рекомендует отказаться от использования Сервиса.",
  },
  {
    title: "Термины",
    list: [
      {
        title:
          "1.1. Лицензиар – Партнерство TOO MONEYDEAL, БИН: 221140056789, владеющее исключительными правами на Сервис и предоставляющее Пользователю право использования функционала Сервиса на основе простой (неисключительной) лицензии.",
      },
      {
        title:
          "1.2. Пользователь – физическое лицо с полными гражданскими правами, которое принимает условия данного Соглашения и использует функциональные возможности Сервиса.",
      },
      {
        title:
          "1.3. Сервис – совокупность информационных ресурсов, текстов, графики, программного обеспечения и иных элементов интеллектуальной собственности, доступных через интернет по адресу.",
      },
      {
        title:
          "1.4. Личный кабинет – специальная функциональная область Сервиса, доступная Пользователю после регистрации, которая предоставляет возможность доступа к платным услугам после их оплаты.",
      },
      {
        title:
          "1.5. Кредитор – организация, указанная в Приложении №1 к Соглашению, с которой Лицензиар заключил договор, позволяющий Кредитору направлять Пользователю уведомления и предложения по заключению Договора займа.",
      },
      {
        title:
          "1.5.1. Партнер – организация, указанная в Приложении №1 к Соглашению, с которой Лицензиар заключил договор на право направлять Пользователю уведомления и предложения.",
      },
      {
        title:
          "1.6. Кредитный рейтинг – показатель кредитоспособности Пользователя, который рассчитывается на основе информации, предоставляемой функционалом Сервиса.",
      },
      {
        title:
          "1.7. Договор о предоставлении микрокредита – договор, подписываемый между Пользователем и Кредитором, который предусматривает предоставление средств на условиях платности, возвратности и срочности.",
      },
      {
        title:
          "1.8. Термины, которые не указаны в данном Соглашении, толкуются в соответствии с законодательством Республики Казахстан.",
      },
    ],
  },
  {
    title: "Общие положения",
    list: [
      {
        title:
          "2.1. Данные Правила касаются всех транзакций, связанных с перечислением денежных средств с банковского счета Плательщика на банковский счет Лицензиара для оплаты услуг.",
      },
      {
        title:
          "2.2. Если Пользователь совершает регулярные Платежи, Правила о возврате могут быть применимы только к тем Платежам, которые были выполнены в течение последних 14 календарных дней до подачи запроса на возврат.",
      },
    ],
  },
  {
    title: "Порядок отмены Платежа",
    list: [
      {
        title: "3.1. Отмена Платежа возможна в следующих случаях:",
        sublist: [
          {
            content:
              "Если карта, реквизиты которой были использованы для оплаты услуг Лицензиара, была утеряна Плательщиком до совершения Платежа.",
          },
          {
            content:
              "Платеж был выполнен без ведома Плательщика или вследствие действий третьих лиц.",
          },
        ],
      },
      {
        title:
          "3.2. Для того чтобы отменить Платеж, Плательщик должен обратиться в Банк-эмитент или оператора Платежной системы.",
      },
      {
        title:
          "3.3. Лицензиар обязуется предоставлять Банку-эмитенту или оператору Платежной системы необходимую информацию для содействия в отмене Платежа.",
      },
    ],
  },
  {
    title: "Порядок возврата Платежа",
    list: [
      {
        title:
          "4.1. Возврат Платежа может быть осуществлен в следующих случаях:",
        sublist: [
          {
            content:
              "Была снята сумма, превышающая указанную в Пользовательском соглашении.",
          },
          {
            content:
              "Пользователю не был предоставлен доступ к платным услугам Сервиса.",
          },
        ],
      },
      {
        title:
          "4.2. Возврат средств является правом, а не обязанностью Лицензиара.",
      },
      {
        title:
          "4.3. Пользователь обязан направить запрос на возврат не позднее 14 календарных дней с момента совершения спорного Платежа.",
      },
      {
        title:
          "4.4. Запрос на возврат средств должен быть отправлен по электронной почте experts@moneydeal.pro или через форму на Сервисе.",
      },
    ],
  },
  {
    title: "Заключительные положения",
    list: [
      {
        title:
          "5.1. Лицензиар оставляет за собой право изменять данные Правила отмены и возврата платежей. Изменения вступают в силу с момента их публикации на Сервисе.",
      },
      {
        title:
          "5.2. Вопросы, которые не регулируются этими Правилами, будут решаться в соответствии с действующим законодательством Республики Казахстан.",
      },
      {
        title:
          "5.3. Если какое-либо из положений данных Правил будет признано недействительным, остальные положения останутся в силе.",
      },
    ],
  },
];


const data_offer = [
  {
    title: "Согласие на обработку персональных данных",
    content:
      "Я, физическое лицо, данные которого указаны при регистрации на сайте https://moneydeal.kz/, являясь субъектом персональных данных, (далее — Субъект), выражаю согласие на обработку моих персональных данных в соответствии с условиями Политики обработки персональных данных TOO MONEYDEAL (БИН: 221140056789) (далее — Оператор) через сайт https://moneydeal.kz (далее – Сервис).",
  },
  {
    title: "Согласие на обработку данных",
    content:
      "Субъект выражает полное безоговорочное согласие со всеми условиями обработки его персональных данных путем проставления галочки в чек-боксе рядом с текстом «Я даю свое согласие на обработку персональных данных и соглашаюсь с политикой обработки персональных данных» в Сервисе. Субъект гарантирует, что перед выражением согласия на обработку персональных данных ознакомился со всеми условиями Политики обработки данных Оператора (далее – Политика).",
  },
  {
    title: "Дееспособность и согласие",
    content:
      "Субъект, выражая согласие на обработку персональных данных, гарантирует, что действует свободно, по своей воле и в своем интересе, и является полностью дееспособным.",
  },
  {
    title: "Обработка персональных данных",
    content:
      "На основании настоящего согласия Субъект дает согласие Оператору на обработку своих персональных данных, а именно:",
    sublist: [
      {
        content: "фамилия, имя, отчество (при наличии);",
      },
      {
        content: "дата рождения;",
      },
      {
        content: "ИИН;",
      },
      {
        content: "адрес электронной почты;",
      },
      {
        content: "номер телефона;",
      },
      {
        content: "cookie-файлы.",
      },
    ],
  },
  {
    title: "Чувствительные данные",
    content:
      "Оператор не обрабатывает чувствительные данные Субъекта (биометрические персональные данные, специальные категории персональных данных).",
  },
  {
    title: "Цели обработки данных",
    content:
      "Цель обработки персональных данных Субъекта – заключение и исполнение пользовательского соглашения, согласно которому TOO MONEYDEAL предоставляет Субъекту доступ к личному кабинету Сервиса, информирует Субъекта о предложениях TOO MONEYDEAL и кредиторов.",
  },
  {
    title: "Действия с персональными данными",
    content:
      "Оператор в процессе обработки персональных данных Субъекта совершает следующие действия: накопление, хранение, изменение, дополнение, использование, обезличивание, блокирование и уничтожение персональных данных и иные действия в соответствии с законодательством Республики Казахстан.",
  },
  {
    title: "Проверка достоверности",
    content:
      "Субъект согласен с тем, что Оператор вправе проверять достоверность информации, указанной Субъектом при регистрации, через открытые источники данных, включая государственные информационные системы.",
  },
  {
    title: "Передача данных третьим лицам",
    content:
      "Субъект согласен с тем, что Оператор вправе передавать персональные данные Субъекта третьим лицам (кредиторам, партнерам и иным лицам, передача персональных данных которым необходимо для исполнения Оператором своих обязательств перед Субъектом или для соблюдения требований законодательства Республики Казахстан), в соответствии с условиями главы 10 Политики.",
  },
  {
    title: "Автоматизация обработки",
    content:
      "Оператор обрабатывает персональные данные Субъекта с использованием средств автоматизации и без их использования. Оператор не принимает никаких решений, порождающих юридические последствия в отношении Субъекта персональных данных или иным образом затрагивающих его права и законные интересы при обработке персональных данных с использованием средств автоматизации.",
  },
  {
    title: "Трансграничная передача данных",
    content:
      "Оператор может осуществлять трансграничную передачу данных – на территорию Российской Федерации, Республики Кипр. Субъект дает безоговорочное согласие на такую трансграничную передачу.",
  },
  {
    title: "Распространение данных",
    content:
      "Оператор не осуществляет распространение персональных данных Субъекта в общедоступных источниках.",
  },
  {
    title: "Срок действия согласия",
    content:
      "Согласие Субъекта на обработку его персональных данных действует в течение 10 (десяти) лет со дня его предоставления. Оператор до истечения указанного срока прекращает обработку персональных данных в случае достижения цели, указанной в согласии или досрочного отзыва согласия, если иное не предусмотрено Политикой или законодательством Республики Казахстан.",
  },
  {
    title: "Отзыв согласия",
    content:
      "Согласие может быть досрочно отозвано путем направления Оператору с адреса электронной почты, указанного Субъектом при регистрации в Сервисе, на адрес электронной почты experts@moneydeal.pro электронное письмо, в котором содержится требование об удалении персональных данных Субъекта. Заявление, указанное в настоящем абзаце, должно соответствовать требованиям, указанным в Политике. Если Субъект отозвал свое Согласие, Оператор немедленно прекращает обработку персональных данных Субъекта, за исключением случаев, предусмотренных законодательством Республики Казахстан.",
  },
];
const data = [
  data_offer,
  public_offer,
  pricing_offer
];


onBeforeUnmount(() => {
  document.body.style.overflow = 'auto';
})
</script>

<template>
  <div
    class="max-[822px]:px-0 max-[822px]:py-0 z-50 overflow-scroll hidden-scroll rounded-xl max-[822px]:rounded-none bg-white  min-h-screen max-h-screen w-3/4 mx-auto mt-20 fixed top-0 bottom-0 max-[822px]:w-full max-[822px]:mt-0 shadow-lg max-[822px]:shadow-none"
  >
    <h3
      class="mx-auto w-full text-center rounded-t-none  shadow-md text-xl py-4 sticky top-0 font-bold text-white bg-slate-900 max-[822px]:py-2 max-[822px]:text-base max-[822px]:font-semibold"
    >
      {{ data[index][0].title }}
    </h3>
    <div
      class=" shadow-lg rounded-md max-[822px]:rounded-none w-full flex flex-col justify-center max-[822px]:w-full max-[822px]:shadow-none cursor-move"
    >
      <div v-for="(item,i) in data[index]" :key="item.title">
        <h2 class="font-bold text-center py-2" v-if="i">{{ item.title }}</h2>
        <p v-if="item.content" class="max-[822px]:text-[12px] p-2">
          {{ item.content }}
        </p>
        <div v-for="(data, k) in item.list" :key="k">
          <p class="text-[12px] text-slate-900 p-1">{{ data.title || "" }}</p>
          <div v-for="(sub_data, i) in data.sublist" :key="i">
            <p class="text-[10px] pl-4 text-slate-600">{{ sub_data.content }}</p>
          </div>
        </div>
      </div>
    </div>
    <Button
      class="hover:bg-slate-400 sticky bottom-0 left-0 right-0 min-w-full"
      :radius="'rounded-b-md max-[822px]:rounded-b-none'"
      @click="store.onPolitics(false)"
      :color="'bg-slate-900'"
      :hover="'bg-slate-300'"
      :text="'text-white'"
      >Закрыть</Button
    >
  </div>
</template>
<style scoped>
.hidden-scroll::-webkit-scrollbar {
  display: none;
}
</style>
