<script setup>
import { useMobileStore } from '~/stores/MobileMenu.js';
const store = useMobileStore();
const props = defineProps({
    index: {
        type: Number,
        required: true,
    }
})
  const data = [
     {
        tarif: {
            title: 'Тариф и политика возмещения расходов',
            content: 'Настоящая Тарифно-компенсационная политика описывает тарифы и порядок оплаты Услуг, предоставляемых Оператором в соответствии с Публичной офертой. Пользователь может обратиться к Услугам, оказываемым в соответствующий Период в нашей Публичной оферте. Настоящим Пользователь соглашается с тем, что, предоставляя персональные данные, в частности банковские реквизиты, необходимые для обработки платежей за пользование Услугами, он ознакомлен и принимает условия Публичной оферты, Политики конфиденциальности и Тарифно-возмездной политики, а также Соглашения о хранении кредита Пользователя. Пожалуйста, ознакомьтесь с его положениями перед заказом Услуг.   ',
            list: ['1. Оплата Услуг, предоставляемых Оператором, делится на следующие периоды:', ' 1.1 Стандартный период - период продолжительностью 15 (пятнадцать) календарных дней, начинающийся в следующем порядке:', ' 1.1.1. Если Пользователь воспользовался Пробным периодом, то Стандартный период начинается на следующий день после Пробного периода и после оплаты Пользователем Услуг и заканчивается на 15 (пятнадцатый) день.', '1.1.2 Если Пользователь не воспользовался Пробным периодом, Стандартный период начинается в день оплаты Услуг.', '1.2 Пробный период - период продолжительностью 7 дней, который начинается с момента оплаты Пользователем Услуг и заканчивается на 7 (седьмой) день. Оператор взимает плату за Стандартный период на следующий день после окончания Пробного периода.', '1.3 Вы имеете право прервать свой Пробный период в течение Пробного периода, чтобы предотвратить начало Стандартного периода. Такое прекращение приведет к потере всего доступа к Сайту Оператора и Услугам Оператора без возврата средств Пользователю. Для прекращения подписки Пользователю необходимо зайти в раздел «Мои  подписки» (https://moneydeal.kz/account), выбрать раздел «Текущие подписки» и нажать кнопку «Отписаться». После этого банковская карта будет отключена от счета.', '1.4 Услуги Оператора предоставляются на условиях подписки с первого дня пробного периода или первого дня стандартного периода.', ' 1.5 Подписка начинается в первый день Пробного периода или в первый день Стандартного периода и длится не более 4 (четырех) Периодов обслуживания с начала Стандартного периода. По окончании подписки Соглашение прекращает свое действие.', '1.6 Пользователь имеет право в любое время прекратить подписку (расторгнуть Соглашение). Такое расторжение влечет за собой потерю всего доступа к сайту Оператора, при этом Оператор не обязан возмещать Пользователю какие-либо расходы. Для прекращения подписки Пользователю необходимо зайти на страницу «Личные данные» (https://moneydeal.kz/account), выбрать раздел «Текущие подписки» и выбрать опцию «Отписаться». После выполнения этих действий персональные данные будут удалены, а банковская карта снята со счета.', '1.7 Каждый Пользователь имеет право только на один Пробный период, который начинается в соответствии со статьей 1.2 настоящей Тарифной политики возврата средств. Если Пользователь прекращает Пробный период, он имеет право получить доступ только к Стандартному периоду. Пробный период не может быть продлен или использован одним Пользователем более одного раза.', '2. Оплата Услуг по настоящему Договору производится на условиях 100% предоплаты в порядке, установленном Договором, настоящим Тарифом и Политикой возмещения.', '3. Вы несете полную ответственность за точность платежа. Если оплата не была произведена в достаточном объеме в связи с истечением срока действия, недостаточностью средств или по другим причинам, а Пользователь не расторгнул Соглашение, Оператор имеет право заблокировать счет Пользователя до полной оплаты.', '4. Обязательства Пользователя по оплате Услуг Оператора не считаются выполненными до получения Оператором полной суммы денежных средств.', '5. Оператор оставляет за собой право изменять цены (стоимость) Услуг в любое время по своему усмотрению. Оператор будет уведомлять Пользователей о таких изменениях путем размещения новой версии Тарифа и Политики возврата средств. Мы рекомендуем периодически проверять настоящую Политику, чтобы быть в курсе текущих цен.', '6. Цены распространяются на стандартные услуги. Если предоставляются дополнительные Услуги, их стоимость будет соответственно увеличена.', '7. Все цены на Услуги Оператора указаны в тенге.', '8. Услуги Оператора не подлежат возврату и не включают в себя банковские тарифы и/или тарифы поставщика транзитных счетов.', '9. Цены на Услуги оператора указаны с учетом НДС (21%).']
        }
     }
  ]
</script>

<template>
      <div class="max-[822px]:px-0 max-[822px]:py-0 z-40 w-3/4 mx-auto mt-20 fixed top-0 max-[822px]:w-full max-[822px]:mt-0">
        <div class="bg-white shadow-lg rounded-lg w-full flex flex-col justify-center max-[822px]:w-full max-[822px]:shadow-none">
            <h3 class="mx-auto w-full text-center shadow-md text-xl py-4 font-bold text-slate-700 max-[822px]:py-2 max-[822px]:text-base">{{data[index].tarif.title}}</h3>
            <section class="py-4 px-4 max-[822px]:px-2 max-[822px]:py-2">
               <article>
                   <p class="text-sm max-[822px]:text-xs">{{data[index].tarif.content}}</p>
                   <ul v-for="(item, index) in data[index].tarif.list" :key="index" class="text-xs px-2 py-1 text-slate-500">
                      <li>{{item}}</li>
                   </ul>
               </article>
            </section>
         
                <Button  class="hover:bg-slate-400" :radius="'rounded-b-md'" @click="store.onPolitics(false)" :color="'bg-slate-900'" :hover="'bg-slate-300'" :text="'text-white'">Закрыть</Button>
            
         </div>
      </div>
</template>