<script setup>
const public_offer = [
  {
    title: "Согласие на обработку персональных данных",
    content:
      "Я, физическое лицо, данные которого указаны при регистрации на сайте https://moneydeal.kz/, являясь субъектом персональных данных, (далее — Субъект), выражаю согласие на обработку моих персональных данных в соответствии с условиями Политики обработки персональных данных TOO MONEYDEAL (БИН: 221140056789) (далее — Оператор) через сайт https://moneydeal.kz (далее – Сервис).",
  },
  {
    title: "Согласие на обработку данных",
    content:
      "Субъект выражает полное безоговорочное согласие со всеми условиями обработки его персональных данных путем проставления галочки в чек-боксе рядом с текстом «Я даю свое согласие на обработку персональных данных и соглашаюсь с политикой обработки персональных данных» в Сервисе. Субъект гарантирует, что перед выражением согласия на обработку персональных данных ознакомился со всеми условиями Политики обработки данных Оператора (далее – Политика).",
  },
  {
    title: "Дееспособность и согласие",
    content:
      "Субъект, выражая согласие на обработку персональных данных, гарантирует, что действует свободно, по своей воле и в своем интересе, и является полностью дееспособным.",
  },
  {
    title: "Обработка персональных данных",
    content:
      "На основании настоящего согласия Субъект дает согласие Оператору на обработку своих персональных данных, а именно:",
    sublist: [
      {
        content: "фамилия, имя, отчество (при наличии);",
      },
      {
        content: "дата рождения;",
      },
      {
        content: "ИИН;",
      },
      {
        content: "адрес электронной почты;",
      },
      {
        content: "номер телефона;",
      },
      {
        content: "cookie-файлы.",
      },
    ],
  },
  {
    title: "Чувствительные данные",
    content:
      "Оператор не обрабатывает чувствительные данные Субъекта (биометрические персональные данные, специальные категории персональных данных).",
  },
  {
    title: "Цели обработки данных",
    content:
      "Цель обработки персональных данных Субъекта – заключение и исполнение пользовательского соглашения, согласно которому TOO MONEYDEAL предоставляет Субъекту доступ к личному кабинету Сервиса, информирует Субъекта о предложениях TOO MONEYDEAL и кредиторов.",
  },
  {
    title: "Действия с персональными данными",
    content:
      "Оператор в процессе обработки персональных данных Субъекта совершает следующие действия: накопление, хранение, изменение, дополнение, использование, обезличивание, блокирование и уничтожение персональных данных и иные действия в соответствии с законодательством Республики Казахстан.",
  },
  {
    title: "Проверка достоверности",
    content:
      "Субъект согласен с тем, что Оператор вправе проверять достоверность информации, указанной Субъектом при регистрации, через открытые источники данных, включая государственные информационные системы.",
  },
  {
    title: "Передача данных третьим лицам",
    content:
      "Субъект согласен с тем, что Оператор вправе передавать персональные данные Субъекта третьим лицам (кредиторам, партнерам и иным лицам, передача персональных данных которым необходимо для исполнения Оператором своих обязательств перед Субъектом или для соблюдения требований законодательства Республики Казахстан), в соответствии с условиями главы 10 Политики.",
  },
  {
    title: "Автоматизация обработки",
    content:
      "Оператор обрабатывает персональные данные Субъекта с использованием средств автоматизации и без их использования. Оператор не принимает никаких решений, порождающих юридические последствия в отношении Субъекта персональных данных или иным образом затрагивающих его права и законные интересы при обработке персональных данных с использованием средств автоматизации.",
  },
  {
    title: "Трансграничная передача данных",
    content:
      "Оператор может осуществлять трансграничную передачу данных – на территорию Российской Федерации, Республики Кипр. Субъект дает безоговорочное согласие на такую трансграничную передачу.",
  },
  {
    title: "Распространение данных",
    content:
      "Оператор не осуществляет распространение персональных данных Субъекта в общедоступных источниках.",
  },
  {
    title: "Срок действия согласия",
    content:
      "Согласие Субъекта на обработку его персональных данных действует в течение 10 (десяти) лет со дня его предоставления. Оператор до истечения указанного срока прекращает обработку персональных данных в случае достижения цели, указанной в согласии или досрочного отзыва согласия, если иное не предусмотрено Политикой или законодательством Республики Казахстан.",
  },
  {
    title: "Отзыв согласия",
    content:
      "Согласие может быть досрочно отозвано путем направления Оператору с адреса электронной почты, указанного Субъектом при регистрации в Сервисе, на адрес электронной почты experts@moneydeal.pro электронное письмо, в котором содержится требование об удалении персональных данных Субъекта. Заявление, указанное в настоящем абзаце, должно соответствовать требованиям, указанным в Политике. Если Субъект отозвал свое Согласие, Оператор немедленно прекращает обработку персональных данных Субъекта, за исключением случаев, предусмотренных законодательством Республики Казахстан.",
  },
];

const contacts = {
  company: "ТОО MONEYDEAL КЗ",
  BIN: "БИН 221140056789",
  address: {
    country: "Казахстан",
    city: "Нур-Султан",
    district: "район Байконур",
    street: "улица Абая",
    house: "дом 12",
    apartment: "кв. 34",
  },
  phone: "+77273145678",
  email: "experts@moneydeal.pro",
};
</script>

<template>
  <NuxtLayout>
    <div
      class="bg-white py-4 px-4 max-[822px]:p-2 max-[822px]:py-16 w-full border-t border-slate-300"
    >
      <div v-for="item in public_offer" :key="item.title">
        <h2 class="font-bold text-center py-0">{{ item.title }}</h2>
        <p v-if="item.content" class="max-[822px]:text-sm text-justify p-2">
          {{ item.content }}
        </p>
        <div v-for="(data, k) in item.list" :key="k">
          <p class="text-sm text-justify text-slate-900 p-1">{{ data.title || "" }}</p>
          <div v-for="(sub_data, i) in data.sublist" :key="i">
            <p class="text-xs text-justify  pl-4 text-slate-600">{{ sub_data.content }}</p>
          </div>
        </div>
      </div>

      <h2 class="font-bold text-center py-2">Контакты Лицензиара</h2>
      <h2 class="font-bold text-left py-2">
        Партнерство {{ contacts.company }}
      </h2>
      <h2 class="font-light text-xs text-left py-2">{{ contacts.BIN }}</h2>
      <h2 class="font-semibold text-left py-2">
        Aдрес:
        <span class="font-light"
          >{{ contacts.address.country }}, {{ contacts.address.city }},
          {{ contacts.address.district }}, {{ contacts.address.street }},
          {{ contacts.address.house }}
        </span>
      </h2>
      <div>
        <h2 class="font-semibold text-left py-2">
          Телефон:
          <span class="font-light">{{ contacts.phone }} </span>
        </h2>
        <h2 class="font-semibold text-left py-2">
          Email:
          <span class="font-light">{{ contacts.email }} </span>
        </h2>
        <NuxtLink
          to="/"
          class="w-full text-center flex justify-center font-bold text-amber-300 py-4"
          >Вернуться на главную</NuxtLink
        >
      </div>
    </div>
  </NuxtLayout>
</template>
