<script setup>
const faqItems = [
  {
    title: "Что мы делаем?",
    content:
      "Сервис обрабатывает заявки клиентов на получение микрокредита. Мы не гарантируем 100% результат, но обычно 8 из 10 наших клиентов получают микрокредит. Благодаря нашим алгоритмам ваша заявка отправится только в подходящие организации.",
    list: [],
  },
  {
    title: "Как получить деньги при плохой кредитной истории?",
    content:
      "Многие кредиторы понимают финансовое положение заемщика, и несмотря на плохую кредитную историю готовы заключить с ним договор о предоставлении микрокредита. Важно помнить, что в каждом конкретном случае кредитор рассматривает не только кредитную историю, но и другую информацию о заемщике, которая также может повлиять на решение кредитора о заключении договора о предоставлении микрокредита.",
    list: [],
  },
  {
    title: "Я работаю неофициально. Получу ли я деньги?",
    content:
      "Вы также можете получить денежные средства. Организации, с которыми мы сотрудничаем, понимают, что у вас есть источник дохода и вы сможете вернуть деньги.",
    list: [],
  },
  {
    title: "Могу ли я получить деньги без прописки в Казахстане?",
    content:
      "Для получения денег необходимо быть гражданином Республики Казахстан, быть старше 18 лет и младше 60 лет, быть полностью дееспособным, иметь мобильный телефон и банковскую карту.",
    list: [],
  },
  {
    title: "Куда мне переведут деньги?",
    content:
      "Вы можете получить деньги прямо на счёт или на банковскую карту любого банка Казахстана.",
    list: [],
  },
  {
    title: "За что снимается плата?",
    content:
      "Мы взимаем плату за предоставление полного доступа к сервису подбора микрокредитов и за отправку вашей анкеты кредитным организациям для принятия решения о предоставлении микрокредита, мы всегда стараемся улучшить наш сервис, чтобы всем было полезно пользоваться им.",
    list: [
      "на главной странице сайта",
      "в пользовательском соглашении",
      "при заполнении анкеты  в первом чек боксе",
      'внизу всех страниц сайта "Действующие тарифы"',
      "дополнительно при прикреплении карты",
    ],
  },
  {
    title: "Как я могу отменить подписку?",
    content:
      'Вы можете отменить подписку на сайте, в разделе меню "Отмена подписки". Если у вас не получается, напишите в раздел "НАПИШИТЕ НАМ", указав последние 4 цифры карты, e-mail и номер телефона, которые указали при оформлении заявки.',
    list: [],
  },
  {
    title: "Как я могу поменять номер карты?",
    content:
      "К сожалению, изменить номер карты невозможно. Вам необходимо создать новый личный кабинет с новыми email-ом и номером телефона. Тогда Вы сможете прикрепить нужную карту. Рекомендуем отменить подписку для предыдущего личного кабинета, так как автоматически это не произойдет и денежные средства будут списываться за доступ к полному функционалу сервиса для каждого из ваших личных кабинетов.",
    list: [],
  },
  {
    title: "Зачем сервису код CVV?",
    content:
      "Код CVV необходимо ввести для того, чтобы с вашей карты была списана сумма для оплаты полного доступа к сервису по подбору микрокредита. Данные карты хранит кредитная организация, которая предоставляет услуги эквайринга, она отвечает за безопасностью данных карты.",
    list: [],
  },
  {
    title: "Что делать если забыл логин и пароль?",
    content:
      'Для того чтобы получить доступ в личный кабинет, Вам нужно кликнуть на кнопку "Войти" в правом верхнем углу страницы сайта, далее нажать на ссылку "Восстановить доступ через e-mail" и заполнить e-mail, который Вы оставляли при заполнении заявки. После этого на указанный Вами e-mail будет отправлен новый пароль, а логин – это ваш номер телефона.',
    list: [],
  },
  {
    title: "Как узнать одобрили мне микрокредит или нет?",
    content:
      "В случае одобрения вашей заявки организация, которая готова выдать микрокредит, уведомляет вас об этом смс сообщением, звонком из колл центра или письмом на email.",
    list: [],
  },
  {
    title: "Почему у меня не получается привязать карту?",
    content:
      "Обычно причин может быть несколько и об этом оповещает платежный шлюз во время привязки карты: не хватает средства на карте, неправильно введен код из смс, некорректно введены данные карты и т.д. Если все это с вашей стороны сделано корректно, то попробуйте привязать другую банковскую карту или снять лимит на интернет оплату, связавшись с банком выдавшим карту.",
    list: [],
  },
  {
    title: "А если у меня нет карты я могу указать номер счёта?",
    content:
      "Увы, нет. Чтобы оставить заявку, нужно использовать только номер банковской карты и подтвердить, что именно вы являетесь ее владельцем, используя смс-код.",
    list: [],
  },
  {
    title: "Как мне удалить мои персональные данные?",
    content:
      'Вам нужно связаться с нашими специалистами через раздел "НАПИШИТЕ НАМ". Укажите последние 4 цифры карты, e-mail и номер телефона которые указали при оформлении заявки. В сообщении укажите: "Прошу удалить мои персональные данные." Напоминаем, что удаление персональных данных является необратимым действием, которое ведет к закрытию личного кабинета.',
    list: [],
  },
  {
    title: "Мне очень срочно нужны деньги. Что делать?",
    content:
      "Для того чтобы получить микрокредит, вам необходимо оставить заявку на нашем сайте. Затем вы получите подходящие для вас предложения в личном кабинете, также вы получите e-mail, push и смс рассылки. Вам нужно выбрать заинтересовавшее вас предложение и отправить заявку. В случае положительного решения со стороны микрофинансовой организации с вами свяжутся сотрудники выбранной организации и предложат подходящие варианты микрокредита.",
    list: [],
  },
  {
    title: "Как оставить заявку?",
    content:
      "Только онлайн на этом сайте. Вы формируете заявку при регистрации, данную заявку сервис направляет кредиторам.",
    list: [],
  },
  {
    title: "Мне одобрили микрокредит, как получить?",
    content:
      "Кредитная организация, которая одобрила микрокредит, сама свяжется с вами. Сервис занимается только подбором. Спасибо, что пользуетесь нашим сервисом. Денежные средства выдаются на условиях, согласованных Вами и микрофинансовой организацией в договоре о предоставлении микрокредита.",
    list: [],
  },
  {
    title: "При отписке от сервиса у меня выдаёт ошибку",
    content: "Возможно Вы некорректно вводите:",
    list: ["номер телефона", "email", "последние 4 цифры карты"],
  },
];

const selectedCard = ref(null);
const onCardSelected = (index) => {
  if (index === selectedCard.value) return (selectedCard.value = null);
  selectedCard.value = index;
};
</script>

<template>
  <NuxtLayout>
    <div class="with-bg-2 min-h-[1020px]  max-h-[1020px] max-[822px]:min-h-svh overflow-y-scroll hidden-scroll">
      <h1
      class="w-full text-center text-3xl max-[822px]:text-2xl font-bold uppercase text-white backdrop-blur-lg bg-slate-700 bg-opacity-60  pt-2 max-[820px]:pt-[42px]"
    >
      Вопросы и ответы
    </h1>
   
    <div
      class="flex items-start pt-4 max-h-full  gap-16 w-full max-[822px]:pt-4  px-4 max-[820px]:py-4 max-[820px]:px-2 max-[820px]:gap-4 cursor-pointer"
    > 
    
      <div class=" flex flex-col gap-1 justify-center">
       
        <div
          v-for="(item, index) in faqItems"
          :key="item.title"
          class="flex group flex-col w-full max-[1224px]:min-w-full items-start bg-opacity-60 text-4xl font-semibold rounded-md text-white transition-all cursor-pointer max-[1024px]:px-2 max-[820px]:px-0 bg-slate-900"
          @click="onCardSelected(index + 1)"
        >
          <div
            class="flex items-center w-full gap-2 px-1 justify-between max-[822px]:gap-0 bg-opacity-60 bg-slate-800 max-[822px]:py-0 max-[822px]:px-1"
            :class="[
              {
                'rounded-t-md': selectedCard === index + 1,
                'rounded-md': selectedCard !== index + 1,
              },
            ]"
          >
            <span
              class="rounded-full transition-transform duration-500 min-h-6 min-w-6 max-[822px]:border-2  max-[822px]:max-h-4 max-[822px]:max-w-4 bg-slate-900 border-2 border-yellow flex items-center justify-center"
            >
              <span
                class="rounded-full group-hover:bg-white transition-all duration-500 group-hover:text-slate-900 h-4 w-4  max-[822px]:max-w-[16px] max-[822px]:max-h-[16px] text-xs max-[822px]:text-[12px] flex items-center justify-center"
                :class="[
                  {
                    'bg-white': selectedCard === index + 1,
                    'text-slate-900': selectedCard === index + 1,
                  },
                ]"
                >{{ index + 1 }}</span
              >
            </span>

            <h3
              class="font-semibold text-center py-2 text-base max-[1024px]:text-[12px] max-[476px]:text-[10px]"
              :class="[
                {
                  'text-yellow': selectedCard === index + 1,
                  'text-white': selectedCard !== index + 1,
                },
              ]"
            >
              {{ item.title }}
            </h3>

            <svg
              v-if="selectedCard !== index + 1"
              fill="#ffffff"
              width="20px"
              height="20px"
              viewBox="0 0 56 56"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M 27.9999 51.9063 C 41.0546 51.9063 51.9063 41.0781 51.9063 28 C 51.9063 14.9453 41.0312 4.0937 27.9765 4.0937 C 14.8983 4.0937 4.0937 14.9453 4.0937 28 C 4.0937 41.0781 14.9218 51.9063 27.9999 51.9063 Z M 27.9999 47.9219 C 16.9374 47.9219 8.1014 39.0625 8.1014 28 C 8.1014 16.9609 16.9140 8.0781 27.9765 8.0781 C 39.0155 8.0781 47.8983 16.9609 47.9219 28 C 47.9454 39.0625 39.0390 47.9219 27.9999 47.9219 Z M 27.9296 39.1328 C 29.1952 39.1328 29.9452 38.2656 29.9452 36.9063 L 29.9452 29.9688 L 37.2812 29.9688 C 38.5936 29.9688 39.5077 29.2890 39.5077 28.0469 C 39.5077 26.7812 38.6405 26.0547 37.2812 26.0547 L 29.9452 26.0547 L 29.9452 18.6953 C 29.9452 17.3125 29.1952 16.4688 27.9296 16.4688 C 26.6874 16.4688 26.0077 17.3594 26.0077 18.6953 L 26.0077 26.0547 L 18.6952 26.0547 C 17.3124 26.0547 16.4452 26.7812 16.4452 28.0469 C 16.4452 29.2890 17.3827 29.9688 18.6952 29.9688 L 26.0077 29.9688 L 26.0077 36.9063 C 26.0077 38.2188 26.6874 39.1328 27.9296 39.1328 Z"
              />
            </svg>
            <svg
              v-else
              width="20px"
              height="20px"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M8 12H16M22 12C22 17.5228 17.5228 22 12 22C6.47715 22 2 17.5228 2 12C2 6.47715 6.47715 2 12 2C17.5228 2 22 6.47715 22 12Z"
                stroke="#ffe11d"
                stroke-width="2"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </div>

          <p
            class="text-sm w-full px-2 rounded-b-md text-justify bg-slate-700 transition-all bg-opacity-60 backdrop-blur-lg duration-300 group-hover:text-orange-300 max-[822px]:group-hover:text-white max-[822px]:text-[10px] max-[822px]:px-2"
            :class="[
              {
                'py-4': index + 1 === selectedCard,
                'py-0': index + 1 !== selectedCard,
                'pt-2': index + 1 === selectedCard,
                'pt-0': index + 1 !== selectedCard,
                'max-h-0': index + 1 !== selectedCard,
                'opacity-0': index + 1 !== selectedCard,
                'max-h-fit': index + 1 === selectedCard,
                block: index + 1 === selectedCard,
              },
            ]"
          >
            {{ item.content }}
            <ul class="text-[12px] text-amber-300 max-[822px]:text-[9px]">
              <li v-for="listItem in item.list" :key="listItem" >- {{listItem}}</li>
           </ul>
          </p>
          
        </div>
      </div>
      <Calculator class="max-[1024px]:hidden sticky top-16"></Calculator>
      
    </div>
    
    </div>
  </NuxtLayout>
</template>
<style>
  .with-bg-2{
    background: url('../assets/faq.webp') 25% 25% / cover fixed;
  }
  
.hidden-scroll::-webkit-scrollbar {
  display: none;
}
</style>