<script setup>
  const faqItems = [
  {
    title: "Что мы делаем?",
    content: "Сервис обрабатывает заявки клиентов на получение микрокредита. Мы не гарантируем 100% результат, но обычно 8 из 10 наших клиентов получают микрокредит. Благодаря нашим алгоритмам ваша заявка отправится только в подходящие организации.",
    list: []
  },
  {
    title: "Как получить деньги при плохой кредитной истории?",
    content: "Многие кредиторы понимают финансовое положение заемщика, и несмотря на плохую кредитную историю готовы заключить с ним договор о предоставлении микрокредита. Важно помнить, что в каждом конкретном случае кредитор рассматривает не только кредитную историю, но и другую информацию о заемщике, которая также может повлиять на решение кредитора о заключении договора о предоставлении микрокредита.",
    list: []
  },
  {
    title: "Я работаю неофициально. Получу ли я деньги?",
    content: "Вы также можете получить денежные средства. Организации, с которыми мы сотрудничаем, понимают, что у вас есть источник дохода и вы сможете вернуть деньги.",
    list: []
  },
  {
    title: "Могу ли я получить деньги без прописки в Казахстане?",
    content: "Для получения денег необходимо быть гражданином Республики Казахстан, быть старше 18 лет и младше 60 лет, быть полностью дееспособным, иметь мобильный телефон и банковскую карту.",
    list: []
  },
  {
    title: "Куда мне переведут деньги?",
    content: "Вы можете получить деньги прямо на счёт или на банковскую карту любого банка Казахстана.",
    list: []
  },
  {
    title: "За что снимается плата?",
    content: "Мы взимаем плату за предоставление полного доступа к сервису подбора микрокредитов и за отправку вашей анкеты кредитным организациям для принятия решения о предоставлении микрокредита, мы всегда стараемся улучшить наш сервис, чтобы всем было полезно пользоваться им.",
    list: [
      "на главной странице сайта",
      "в пользовательском соглашении",
      "при заполнении анкеты  в первом чек боксе",
      "внизу всех страниц сайта \"Действующие тарифы\"",
      "дополнительно при прикреплении карты"
    ]
  },
  {
    title: "Как я могу отменить подписку?",
    content: "Вы можете отменить подписку на сайте, в разделе меню \"Отмена подписки\". Если у вас не получается, напишите в раздел \"НАПИШИТЕ НАМ\", указав последние 4 цифры карты, e-mail и номер телефона, которые указали при оформлении заявки.",
    list: []
  },
  {
    title: "Как я могу поменять номер карты?",
    content: "К сожалению, изменить номер карты невозможно. Вам необходимо создать новый личный кабинет с новыми email-ом и номером телефона. Тогда Вы сможете прикрепить нужную карту. Рекомендуем отменить подписку для предыдущего личного кабинета, так как автоматически это не произойдет и денежные средства будут списываться за доступ к полному функционалу сервиса для каждого из ваших личных кабинетов.",
    list: []
  },
  {
    title: "Зачем сервису код CVV?",
    content: "Код CVV необходимо ввести для того, чтобы с вашей карты была списана сумма для оплаты полного доступа к сервису по подбору микрокредита. Данные карты хранит кредитная организация, которая предоставляет услуги эквайринга, она отвечает за безопасностью данных карты.",
    list: []
  },
  {
    title: "Что делать если забыл логин и пароль?",
    content: "Для того чтобы получить доступ в личный кабинет, Вам нужно кликнуть на кнопку \"Войти\" в правом верхнем углу страницы сайта, далее нажать на ссылку \"Восстановить доступ через e-mail\" и заполнить e-mail, который Вы оставляли при заполнении заявки. После этого на указанный Вами e-mail будет отправлен новый пароль, а логин – это ваш номер телефона.",
    list: []
  },
  {
    title: "Как узнать одобрили мне микрокредит или нет?",
    content: "В случае одобрения вашей заявки организация, которая готова выдать микрокредит, уведомляет вас об этом смс сообщением, звонком из колл центра или письмом на email.",
    list: []
  },
  {
    title: "Почему у меня не получается привязать карту?",
    content: "Обычно причин может быть несколько и об этом оповещает платежный шлюз во время привязки карты: не хватает средства на карте, неправильно введен код из смс, некорректно введены данные карты и т.д. Если все это с вашей стороны сделано корректно, то попробуйте привязать другую банковскую карту или снять лимит на интернет оплату, связавшись с банком выдавшим карту.",
    list: []
  },
  {
    title: "А если у меня нет карты я могу указать номер счёта?",
    content: "Увы, нет. Чтобы оставить заявку, нужно использовать только номер банковской карты и подтвердить, что именно вы являетесь ее владельцем, используя смс-код.",
    list: []
  },
  {
    title: "Как мне удалить мои персональные данные?",
    content: "Вам нужно связаться с нашими специалистами через раздел \"НАПИШИТЕ НАМ\". Укажите последние 4 цифры карты, e-mail и номер телефона которые указали при оформлении заявки. В сообщении укажите: \"Прошу удалить мои персональные данные.\" Напоминаем, что удаление персональных данных является необратимым действием, которое ведет к закрытию личного кабинета.",
    list: []
  },
  {
    title: "Мне очень срочно нужны деньги. Что делать?",
    content: "Для того чтобы получить микрокредит, вам необходимо оставить заявку на нашем сайте. Затем вы получите подходящие для вас предложения в личном кабинете, также вы получите e-mail, push и смс рассылки. Вам нужно выбрать заинтересовавшее вас предложение и отправить заявку. В случае положительного решения со стороны микрофинансовой организации с вами свяжутся сотрудники выбранной организации и предложат подходящие варианты микрокредита.",
    list: []
  },
  {
    title: "Как оставить заявку?",
    content: "Только онлайн на этом сайте. Вы формируете заявку при регистрации, данную заявку сервис направляет кредиторам.",
    list: []
  },
  {
    title: "Мне одобрили микрокредит, как получить?",
    content: "Кредитная организация, которая одобрила микрокредит, сама свяжется с вами. Сервис занимается только подбором. Спасибо, что пользуетесь нашим сервисом. Денежные средства выдаются на условиях, согласованных Вами и микрофинансовой организацией в договоре о предоставлении микрокредита.",
    list: []
  },
  {
    title: "При отписке от сервиса у меня выдаёт ошибку. Что делать?",
    content: "Возможно Вы некорректно вводите:",
    list: [
      "номер телефона",
      "email",
      "последние 4 цифры карты"
    ]
  }
];
</script>

<template>
    
</template>