<script setup>
let public_offer = [
  {
    title: "Пользовательское соглашение",
    content:
      "Данный документ устанавливает отношения между Лицензиаром и Пользователем при использовании функциональных возможностей Сервиса. Соглашение выступает договором присоединения. Внимательно ознакомьтесь с текстом документа. Если вы не согласны с его условиями, TOO MONEYDEAL рекомендует отказаться от использования Сервиса.",
  },
  {
    title: "Термины",
    list: [
      {
        title:
          "1.1. Лицензиар – Партнерство TOO MONEYDEAL, БИН: 221140056789, владеющее исключительными правами на Сервис и предоставляющее Пользователю право использования функционала Сервиса на основе простой (неисключительной) лицензии.",
      },
      {
        title:
          "1.2. Пользователь – физическое лицо с полными гражданскими правами, которое принимает условия данного Соглашения и использует функциональные возможности Сервиса.",
      },
      {
        title:
          "1.3. Сервис – совокупность информационных ресурсов, текстов, графики, программного обеспечения и иных элементов интеллектуальной собственности, доступных через интернет по адресу.",
      },
      {
        title:
          "1.4. Личный кабинет – специальная функциональная область Сервиса, доступная Пользователю после регистрации, которая предоставляет возможность доступа к платным услугам после их оплаты.",
      },
      {
        title:
          "1.5. Кредитор – организация, указанная в Приложении №1 к Соглашению, с которой Лицензиар заключил договор, позволяющий Кредитору направлять Пользователю уведомления и предложения по заключению Договора займа.",
      },
      {
        title:
          "1.5.1. Партнер – организация, указанная в Приложении №1 к Соглашению, с которой Лицензиар заключил договор на право направлять Пользователю уведомления и предложения.",
      },
      {
        title:
          "1.6. Кредитный рейтинг – показатель кредитоспособности Пользователя, который рассчитывается на основе информации, предоставляемой функционалом Сервиса.",
      },
      {
        title:
          "1.7. Договор о предоставлении микрокредита – договор, подписываемый между Пользователем и Кредитором, который предусматривает предоставление средств на условиях платности, возвратности и срочности.",
      },
      {
        title:
          "1.8. Термины, которые не указаны в данном Соглашении, толкуются в соответствии с законодательством Республики Казахстан.",
      },
    ],
  },
  {
    title: "Общие положения",
    list: [
      {
        title: "2.1. Данные Правила касаются всех транзакций, связанных с перечислением денежных средств с банковского счета Плательщика на банковский счет Лицензиара для оплаты услуг.",
      },
      {
        title: "2.2. Если Пользователь совершает регулярные Платежи, Правила о возврате могут быть применимы только к тем Платежам, которые были выполнены в течение последних 14 календарных дней до подачи запроса на возврат.",
      },
    ],
  },
  {
    title: "Порядок отмены Платежа",
    list: [
      {
        title: "3.1. Отмена Платежа возможна в следующих случаях:",
        sublist: [
          { content: "Если карта, реквизиты которой были использованы для оплаты услуг Лицензиара, была утеряна Плательщиком до совершения Платежа." },
          { content: "Платеж был выполнен без ведома Плательщика или вследствие действий третьих лиц." },
        ],
      },
      {
        title: "3.2. Для того чтобы отменить Платеж, Плательщик должен обратиться в Банк-эмитент или оператора Платежной системы.",
      },
      {
        title: "3.3. Лицензиар обязуется предоставлять Банку-эмитенту или оператору Платежной системы необходимую информацию для содействия в отмене Платежа.",
      },
    ],
  },
  {
    title: "Порядок возврата Платежа",
    list: [
      {
        title: "4.1. Возврат Платежа может быть осуществлен в следующих случаях:",
        sublist: [
          { content: "Была снята сумма, превышающая указанную в Пользовательском соглашении." },
          { content: "Пользователю не был предоставлен доступ к платным услугам Сервиса." },
        ],
      },
      {
        title: "4.2. Возврат средств является правом, а не обязанностью Лицензиара.",
      },
      {
        title: "4.3. Пользователь обязан направить запрос на возврат не позднее 14 календарных дней с момента совершения спорного Платежа.",
      },
      {
        title: "4.4. Запрос на возврат средств должен быть отправлен по электронной почте experts@moneydeal.pro или через форму на Сервисе.",
      },
    ],
  },
  {
    title: "Заключительные положения",
    list: [
      {
        title: "5.1. Лицензиар оставляет за собой право изменять данные Правила отмены и возврата платежей. Изменения вступают в силу с момента их публикации на Сервисе.",
      },
      {
        title: "5.2. Вопросы, которые не регулируются этими Правилами, будут решаться в соответствии с действующим законодательством Республики Казахстан.",
      },
      {
        title: "5.3. Если какое-либо из положений данных Правил будет признано недействительным, остальные положения останутся в силе.",
      },
    ],
  },
]; 


const contacts = {
  company: "ТОО MONEYDEAL КЗ",
  BIN: "БИН 221140056789",
  address: {
    country: "Казахстан",
    city: "Нур-Султан",
    district: "район Байконур",
    street: "улица Абая",
    house: "дом 12",
    apartment: "кв. 34",
  },
  phone: "+77273145678",
  email: "experts@moneydeal.pro",
};

</script>

<template>
 <NuxtLayout>
  <div class="bg-white py-4 px-24  max-[822px]:p-2 max-[822px]:py-16 w-full border-t border-slate-300">
    <div v-for="item in public_offer" :key="item.title">
        <h2 class="font-bold text-center py-2">{{ item.title }}</h2>
        <p v-if="item.content" class="max-[822px]:text-sm p-2">
          {{ item.content }}
        </p>
        <div v-for="(data, k) in item.list" :key="k">
          <p class="text-sm text-slate-900 p-1">{{ data.title || "" }}</p>
          <div v-for="(sub_data, i) in data.sublist" :key="i">
            <p class="text-xs pl-4 text-slate-600">{{ sub_data.content }}</p>
          </div>
        </div>
      </div>

      <h2 class="font-bold text-center py-2">Контакты Лицензиара</h2>
      <h2 class="font-bold text-left py-2">
        Партнерство {{ contacts.company }}
      </h2>
      <h2 class="font-light text-xs text-left py-2">{{ contacts.BIN }}</h2>
      <h2 class="font-semibold text-left py-2">
        Aдрес:
        <span class="font-light"
          >{{ contacts.address.country }}, {{ contacts.address.city }},
          {{ contacts.address.district }}, {{ contacts.address.street }},
          {{ contacts.address.house }}
        </span>
      </h2>
      <div>
      <h2 class="font-semibold text-left py-2">
        Телефон:
        <span class="font-light">{{ contacts.phone }} </span>
      </h2>
      <h2 class="font-semibold text-left py-2">
        Email:
        <span class="font-light">{{ contacts.email }} </span>
      </h2>
      <NuxtLink
        to="/"
        class="w-full text-center flex justify-center font-bold text-amber-300 py-4"
        >Вернуться на главную</NuxtLink
      >
    </div>
  </div>
 </NuxtLayout>
    
</template>