<script setup>
const privacy_offer = [
  {
    title: "Политика обработки персональных данных",
    list: [
      {
        title: "1. Назначение Политики",
        sublist: [
          {
            content:
              "Настоящий документ определяет политику Оператора в отношении Обработки Персональных данных Субъекта Персональных данных — пользователя сайта https://moneydeal.kz (далее – Сервис).",
          },
          {
            content:
              "Оператор осуществляет Обработку Персональных данных, обеспечивает защиту прав и свобод Субъектов при Обработке их Персональных данных и принимает меры для обеспечения выполнения обязанностей, предусмотренных Законом о ПД и принятыми в соответствии с ним нормативными правовыми актами.",
          },
        ],
      },
      {
        title: "2. Основные понятия, используемые в Политике",
        sublist: [
          {
            content:
              "Персональные данные – ведения, относящиеся к определенному или определяемому на их основании Субъекту Персональных данных, зафиксированные на электронном, бумажном и (или) ином материальном носителе.",
          },
          {
            content:
              "Субъект Персональных данных (Субъект) – физическое лицо, которое прямо или косвенно определено или определяемо с помощью Персональных данных, являющееся Пользователем.",
          },
          {
            content:
              "Сервис — сайт в сети Интернет (URL): https://moneydeal.kz правообладателем которого является TOO MONEYDEAL. Сервис представляет собой составной объект интеллектуальной собственности в составе специальным образом подобранных и расположенных программ для ЭВМ и других программных средств, баз данных, графического контента и других произведений, объединенных для обеспечения нормального функционирования Сервиса и использования его возможностей.",
          },
          {
            content:
              "Пользователь – дееспособное физическое лицо, принявшее условия Пользовательского соглашения. Пользовательское соглашение расположено в информационно-телекоммуникационной сети «Интернет» по адресу: https://moneydeal.kz/documents/public-offer/",
          },
          {
            content:
              "Оператор – товарищество с ограниченной ответственностью «MONEYDEAL» (БИН: 221140056789, Казахстан, город Алматы, Алмалинский район, Проспект Нұрсұлтан Назарбаев, дом 113/55, н.п. 40), которое самостоятельно или совместно с другими лицами организует и (или) осуществляет Обработку Персональных данных, а также определяет цели Обработки Персональных данных, состав Персональных данных, подлежащих Обработке, действия (операции), совершаемые с Персональными данными.",
          },
          {
            content:
              "Обработка Персональных данных – действия, направленные на накопление, хранение, изменение, дополнение, использование, распространение, обезличивание, блокирование и уничтожение Персональных данных.",
          },
          {
            content:
              "Автоматизированная Обработка Персональных данных – Обработка Персональных данных с помощью средств вычислительной техники.",
          },
          {
            content:
              "Накопление Персональных данных — действия по систематизации Персональных данных путем их внесения в базу, содержащую Персональные данные.",
          },
          {
            content:
              "Блокирование Персональных данных — действия по временному прекращению сбора, накопления, изменения, дополнения, использования, распространения, обезличивания и уничтожения Персональных данных.",
          },
          {
            content:
              "Сбор Персональных данных — действия, направленные на получение Персональных данных.",
          },
          {
            content:
              "Уничтожение Персональных данных — действия, в результате совершения которых невозможно восстановить Персональные данные.",
          },
          {
            content:
              "Обезличивание Персональных данных — действия, в результате совершения которых определение принадлежности Персональных данных Субъекту.",
          },
          {
            content:
              "Использование Персональных данных — действия с Персональными данными, направленные на реализацию целей деятельности собственника, оператора и третьего лица.",
          },
          {
            content:
              "Распространение Персональных данных – действия, в результате совершения которых происходит передача Персональных данных, в том числе через средства массовой информации или предоставление доступа к Персональным данным каким-либо иным способом.",
          },
          {
            content:
              "Предоставление Персональных данных – действия, направленные на раскрытие Персональных данных определенному лицу или определенному кругу лиц.",
          },
          {
            content:
              "Информационная система Персональных данных – совокупность содержащихся в базах данных Персональных данных и обеспечивающих их Обработку информационных технологий и технических средств.",
          },
          {
            content:
              "Законодательство – действующее законодательство Республики Казахстан.",
          },
          {
            content:
              "Cookie-файлы («куки-файлы», в переводе с англ. «печенье») — файлы и иные идентификаторы персональных данных, позволяющих вычислить Пользователя и выделить его среди других лиц, хранящиеся на компьютере пользователя, для его дальнейшей идентификации на сайте.",
          },
        ],
      },
      {
        title: "3. Общие принципы Обработки Персональных данных Оператором",
        sublist: [
          {
            content:
              "Обработка Персональных данных осуществляется на законной и справедливой основе.",
          },
          {
            content:
              "Обработка Персональных данных осуществляется с согласия Пользователя или при наличии иного основания, предусмотренного Законодательством о Персональных данных, до достижения цели Обработки Персональных данных, если иное не предусмотрено Законодательством.",
          },
          {
            content:
              "Обработка Персональных данных ограничивается достижением конкретных, заранее определенных и законных целей, указанных в Политике.",
          },
          {
            content:
              "Не допускается объединение баз данных, информации на материальных носителях, содержащих Персональные данные, Обработка которых осуществляется в целях, несовместимых между собой.",
          },
          {
            content:
              "Обработке подлежат только Персональные данные, которые отвечают целям их Обработки.",
          },
          {
            content:
              "Содержание и объем обрабатываемых Персональных данных соответствуют заявленным целям Обработки.",
          },
          {
            content:
              "Обрабатываемые Персональные данные не должны быть избыточными по отношению к заявленным целям Обработки.",
          },
          {
            content:
              "При Обработке Персональных данных обеспечивается точность Персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям Обработки Персональных данных. Оператор принимает необходимые меры либо обеспечивает их принятие (в случае если Обработка Персональных данных осуществляется третьим лицом) по удалению или уточнению неполных или неточных данных.",
          },
          {
            content:
              "Хранение Персональных данных осуществляется в форме, позволяющей определить Субъекта, в течение срока установленным Законодательством, либо договором, заключенным с Пользователем, либо согласием на Обработку Персональных данных.",
          },
        ],
      },
      {
        title: "4. Правовые основания Обработки Персональных данных",
        sublist: [
          {
            content:
              "Правовыми основаниями Обработки Персональных данных является совокупность нормативных правовых актов, во исполнение и в соответствии с которыми Оператор осуществляет Обработку Персональных данных, в том числе:",
          },
          {
            content: "Конституция Республики Казахстан;",
          },
          {
            content: "Гражданский кодекс Республики Казахстан;",
          },
          {
            content:
              "Закон Республики Казахстан от 21 мая 2013 года № 94-V «О Персональных данных и их защите» (далее. – Закон о ПД);",
          },
          {
            content:
              "договор, стороной которого либо выгодоприобретателем является Субъект;",
          },
          {
            content: "согласие Субъекта;",
          },
          {
            content: "другие документы, в том числе Законодательство.",
          },
        ],
      },
      {
        title: "5. Прочие положения",
        sublist: [
          {
            content:
              "Оператор не осуществляет Обработку Персональных данных без оснований, предусмотренных Законодательством и (или) за пределами условий Обработки Персональных данных, указанных в Законодательстве.",
          },
        ],
      },

      {
        title:
          "6. Права и обязанности Оператора и Субъектов Персональных данных",
        sublist: [
          {
            content:
              "Оператор обеспечивает права Субъектов в порядке, установленном ст. ст. 20, 22 Закона о ПД.",
          },
          {
            content: "Оператор имеет право:",
            sublist: [
              {
                content:
                  "Защищать свои интересы в суде и других государственных и муниципальных органах.",
              },
              {
                content:
                  "Проверять достоверность информации, указанной Субъектом при регистрации, через открытые источники данных, включая государственные информационные системы.",
              },
              {
                content:
                  "Предоставлять Персональные данные Субъектов третьим лицам на основаниях, предусмотренных Законодательством. Перечень третьих лиц, которым Оператор передает Персональные данные Субъекта, указан в Политике.",
              },
              {
                content:
                  "Обрабатывать Персональные данные Субъекта с помощью метрик программ Яндекс.Метрика, Google Analytics, Пиксель Вконтакте, Пиксель Facebook, Пиксель top@mail.ru, Пиксель Google Tag Manager.",
              },
              {
                content:
                  "Требовать от Субъекта своевременного уточнения предоставленных Персональных данных.",
              },
              {
                content:
                  "Передавать Персональные данные Субъектов другим (третьим) лицам в случаях, когда это необходимо для выполнения договора между Субъектом и Сервисом.",
              },
              {
                content:
                  "Предоставлять информацию о Субъекте третьим лицам для выявления и прекращения мошеннических действий, устранения технических неполадок или проблем с безопасностью.",
              },
            ],
          },
          {
            content: "Оператор обязан:",
            sublist: [
              {
                content:
                  "Соблюдать конфиденциальность Персональных данных, а именно не разглашать третьим лицам и не распространять Персональные данные без согласия Субъекта, если иное не предусмотрено Законодательством и не вытекает из сути договора между Субъектом и Сервисом.",
              },
              {
                content:
                  "При сборе Персональных данных, включая сеть Интернет, обеспечить Обработку Персональных данных граждан Республики Казахстан с использованием баз данных, находящихся на территории Республики Казахстан.",
              },
              {
                content:
                  "Приостановить Обработку и уничтожить или анонимизировать Персональные данные в случаях, предусмотренных Законодательством.",
              },
              {
                content:
                  "Принять меры по уточнению, уничтожению, анонимизации Персональных данных Субъекта в связи с его обращением с законными и обоснованными требованиями.",
              },
              {
                content:
                  "Хранить Персональные данные в форме, которая позволяет определить Субъекта, в течение срока хранения Персональных данных, определенного в Соглашении пользователя, или в согласии на Обработку Персональных данных, но не более срока, указанного в п. 9.6 Политики.",
              },
              {
                content:
                  "Предоставить информацию о производимой Обработке Персональных данных относительно Субъекта по запросу (обращению) последнего и уполномоченных органов по защите прав Субъектов Персональных данных.",
              },
            ],
          },
          {
            content:
              "Оператор признает Персональные данные конфиденциальной информацией и осуществляет Обработку такой информации в соответствии с Законодательством (гл. 2 Закона о ПД) и локальными нормативными актами, содержащими положения о работе с конфиденциальной информацией.",
          },
          {
            content:
              "Не является нарушением конфиденциальности Персональных данных предоставление Оператором информации третьим лицам, действующим на основании договора с Оператором для выполнения обязательств перед Субъектом.",
          },
          {
            content:
              "Оператор осуществляет хранение Персональных данных таким образом, что исключает их утрату или неправомерное использование в базах данных, находящихся на территории Республики Казахстан.",
          },
          {
            content: "Субъект имеет право:",
            sublist: [
              {
                content:
                  "на бесплатное ознакомление со своими Персональными данными, которые обрабатываются Оператором, за исключением случаев, предусмотренных Законодательством;",
              },
              {
                content:
                  "на получение информации, касающейся Обработки его Персональных данных;",
              },
              {
                content:
                  "требовать от Оператора уточнения его Персональных данных, их блокировки или уничтожения в случаях, если Персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели Обработки, а также принимать предусмотренные законом меры для защиты своих прав;",
              },
              {
                content:
                  "оспаривать действия или бездействие Оператора в уполномоченный орган по защите прав Субъектов Персональных данных или в судебном порядке;",
              },
              {
                content:
                  "на защиту своих прав и законных интересов, в том числе на возмещение убытков и (или) компенсацию морального вреда в судебном порядке.",
              },
            ],
          },
          {
            content: "Субъект обязан:",
            sublist: [
              {
                content:
                  "предоставлять Оператору достоверную информацию о себе и предоставлять документы, содержащие Персональные данные, состав которых установлен Законодательством и локальными нормативными документами в объеме, необходимом для цели Обработки;",
              },
              {
                content:
                  "уведомлять Оператора о уточнении (обновлении, изменении) своих Персональных данных;",
              },
              {
                content:
                  "соблюдать Политику и Законодательство о Персональных данных.",
              },
            ],
          },
        ],
      },
      {
        title:
          "7. Цели Обработки, объем и категории обрабатываемых Персональных данных",
        sublist: [
          {
            content:
              "Оператор использует Персональные данные с следующими целями:",
          },
          {
            content:
              "Заключение и выполнение договора пользователя, в соответствии с которым ТОО «MONEYDEAL» предоставляет Субъекту доступ к функционалу Личного кабинета в Сервисе:",
            sublist: [
              {
                content: "фамилия, имя, отчество (при наличии);",
              },
              {
                content: "ИНН;",
              },
              {
                content: "город получения микрокредита;",
              },
              {
                content: "дата рождения;",
              },
              {
                content: "адрес электронной почты;",
              },
              {
                content: "номер телефона;",
              },
              {
                content: "cookie-файлы.",
              },
            ],
          },
          {
            content: "Рассмотрение обращений и претензий Субъекта:",
            sublist: [
              {
                content: "фамилия, имя, отчество (при наличии);",
              },
              {
                content: "адрес электронной почты;",
              },
              {
                content: "номер телефона;",
              },
              {
                content: "cookie-файлы.",
              },
            ],
          },
        ],
      },
      {
        title: "8. Субьекты Персональных данных",
        sublist: [
          {
            content:
              "Субъектами в соответствии с условиями Политики являются Пользователи Сервиса.",
          },
          {
            content:
              "Пользователь, используя функционал Сервиса, передает свои Персональные данные Оператору. Субъект добровольно, своей волей и в своем интересе предоставляет Оператору добровольное, информированное, сознательное и юридически значимое согласие на Обработку его Персональных данных путем проставления «галочки» в чек-боксе и выражает свое безоговорочное согласие с данной Политикой и указанными в ней условиями Обработки его Персональных данных.",
          },
        ],
      },
    ],
  },
];

const contacts = {
  company: "ТОО MONEYDEAL КЗ",
  BIN: "БИН 221140056789",
  address: {
    country: "Казахстан",
    city: "Нур-Султан",
    district: "район Байконур",
    street: "улица Абая",
    house: "дом 12",
    apartment: "кв. 34",
  },
  phone: "+77273145678",
  email: "experts@moneydeal.pro",
};
</script>

<template>
  <NuxtLayout>
    <div
      class="bg-white py-4 px-24 max-[822px]:p-2 max-[822px]:py-16 w-full border-t border-slate-300"
    >
      <div v-for="item in privacy_offer" :key="item.title">
        <h2 class="font-bold text-center py-2">{{ item.title }}</h2>
        <p v-if="item.content" class="max-[822px]:text-sm p-2">
          {{ item.content }}
        </p>
        <div v-for="(data, k) in item.list" :key="k">
          <p class="text-sm text-slate-900 p-1">{{ data.title || "" }}</p>
          <div v-for="(sub_data, i) in data.sublist" :key="i">
            <p class="text-xs pl-4 text-slate-600">{{ sub_data.content }}</p>
          </div>
        </div>
      </div>

      <h2 class="font-bold text-center py-2">Контакты Лицензиара</h2>
      <h2 class="font-bold text-left py-2">
        Партнерство {{ contacts.company }}
      </h2>
      <h2 class="font-light text-xs text-left py-2">{{ contacts.BIN }}</h2>
      <h2 class="font-semibold text-left py-2">
        Aдрес:
        <span class="font-light"
          >{{ contacts.address.country }}, {{ contacts.address.city }},
          {{ contacts.address.district }}, {{ contacts.address.street }},
          {{ contacts.address.house }}
        </span>
      </h2>
      <h2 class="font-semibold text-left py-2">
        Телефон:
        <span class="font-light">{{ contacts.phone }} </span>
      </h2>
      <h2 class="font-semibold text-left py-2">
        Email:
        <span class="font-light">{{ contacts.email }} </span>
      </h2>
      <NuxtLink
        to="/"
        class="w-full text-center flex justify-center font-bold text-amber-300 py-4"
        >Вернуться на главную</NuxtLink
      >
    </div>
  </NuxtLayout>
</template>
