<script setup>

const serviceInfo = [
  {
    title: null,
    content: "Сервис «MONEYDEAL» — это онлайн-платформа, которая помогает пользователям выбрать оптимальный микрокредит. Вы можете отправить заявку сразу в несколько кредитных организаций, отобранных на основе ваших данных."
  },
  {
    title: "Что мы делаем?",
    content: "Наша платформа принимает и обрабатывает заявки на микрокредиты. Вы заполняете заявку на сайте, указываете нужную сумму и срок займа, а также другие важные данные. Мы отправляем вашу заявку нескольким компаниям, которые могут предоставить микрокредит, и с высокой вероятностью одобрят её, после чего деньги поступят на вашу карту."
  },
  {
    title: "Как мы это делаем?",
    content: null,
    list: [
      "Мы сотрудничаем с десятками финансовых организаций по всей Казахстану и направляем вашу заявку только в те компании, которые соответствуют вашим требованиям. Это повышает шансы на одобрение.",
      "Сервис доступен круглосуточно. Даже если вам срочно понадобятся деньги ночью, вы можете оставить заявку, и в течение 15 минут получите ответ.",
      "Для подачи заявки необходимо указать ваше полное имя, ИИН, дату рождения, контактные данные, а также сумму и срок микрокредита."
    ]
  },
  {
    title: "Преимущества работы с нами",
    content: null
  },
  {
    title: "География",
    content: "Получить деньги может любой гражданин Казахстана, независимо от его места проживания.",
    icon: null
  },
  {
    title: "Экономия ваших денег",
    content: "Мы помогаем вам выбрать микрокредит с наиболее выгодными условиями и низкими процентными ставками.",
    icon: null
  },
  {
    title: "Скорость одобрения",
    content: "Заявки, отправленные через нашу платформу, обрабатываются партнёрскими организациями в день их получения.",
    icon: null
  },

   {
    title: "Преимущества работы с нами",
    content: null,
    list: [
      {
        title: "География",
        content: "Получить деньги может любой гражданин Казахстана, независимо от его места проживания.",
        icon: null
      },
      {
        title: "Экономия ваших денег",
        content: "Мы помогаем вам выбрать микрокредит с наиболее выгодными условиями и низкими процентными ставками.",
        icon: null
      },
      {
        title: "Скорость одобрения",
        content: "Заявки, отправленные через нашу платформу, обрабатываются партнёрскими организациями в день их получения.",
        icon: null
      }
    ]
  }
];
</script>

<template>

</template>